README.org
#+title: They Call Me Brett
#+EXPORT_FILE_NAME: index.html
#+setupfile: setup.org

Links and information associated with the named corporeal being.

* Social

- bv at bnl dot gov (work)
- brett dot viren at gmail dot com (personal)
- ~@bv:matrix.org~
- https://github.com/brettviren/
- https://fosstodon.org/@bv
- https://twitter.com/brett_viren
- https://keybase.io/brettviren
- https://www.reddit.com/user/brettviren

* Physics

- https://www.phy.bnl.gov/~bviren/ is mostly a file distribution area
- many of the software links pertain to my physics work

* Software

** Organizations

A few of the software organizations (loose definition) I contribute to

- [[https://github.com/wirecell/][Wire-Cell project]] (arch/dev/writer)
  - related [[https://github.com/brettviren/pcbro][PCB readout]]
  - and [[https://github.com/brettviren/drifires][field calculator]] (see also [[https://github.com/brettviren/larf][larf]])
- [[https://github.com/DUNE][DUNE repos]] (GH org manager, dev/writer)
- [[https://github.com/DUNE-DAQ][DUNE DAQ]] (dev/writer)
  - related [[https://github.com/brettviren/ptmp][ptmp]] and [[https://github.com/brettviren/ptmp-tcs][ptmp-tcs]] self trigger for ProtoDUNE-SP detector and [[https://github.com/brettviren/tpquery][tpquery]] trigger primitive server.
- [[https://github.com/ls4gan][LS4GAN]] (initial idea, LDRD co-recipient) 

** Packages

I currently use [[https://github.com/brettviren/][GitHub/brettviren]] for all my publicly available software, documentation and configuration.  

- [[https://brettviren.github.io/moo/][moo]] is a tool for schema driven code generation used in DUNE-DAQ and others.
- [[https://brettviren.github.io/zio/][zio]] provides a high-level interface to ZeroMQ, Zyre and implements some patterns described in the zguide.  Provides the ~domo~ and ~flow~ protocols.
- [[https://github.com/brettviren/yamz][yamz]] is you and me, Zyre.
- [[https://github.com/brettviren/gegede][gegede]] is for general geometry description (for describing detector geometry).
- [[https://brettviren.github.io/herbie][herbie]] is a herbstluftwm interactive environment thingy.
- [[https://github.com/brettviren/rephile][rephile]] photo manager
- [[https://brettviren.github.io/cppzmq-tour][cppzmq tour]] gives a walk through of one of the C++ bindings to ZeroMQ (and a wip companion giving a cppzmq version of ZeroMQ security [[https://github.com/brettviren/cppzmq-houses]["houses"]]).
  - related [[https://github.com/brettviren/generaldomo][generaldomo]] generalizes ZeroMQ majordomo to CLIENT/SERVER sockets (see also ~domo~ in ZIO)
- [[https://github.com/brettviren/zperfmq][zperfmq]] tests ZeroMQ performance, applied to a 100 Gbps test network.
- [[https://github.com/brettviren/gravio][gravio]] plays with graph visualization.
- Two implementations of [[https://github.com/barabo/advanced-shell-history][advanced-shell-history]]: [[https://github.com/brettviren/fishql][fishql]] for Fish shell and [[https://github.com/brettviren/shist][shist]] for Bash shell.
- [[https://github.com/brettviren/nuosc][nuosc++]] package for calculating neutrino oscillation probabilities in vacuum, constant and arbitrary matter.
- [[https://github.com/brettviren?tab=repositories][all my repos]] including many experimental dead ends and a few forked from others.

** Etc

- [[file:howido.org][how I do some things]]
