index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-09 Tue 14:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>They Call Me Brett</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/darksun.css"/>
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">They Call Me Brett</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9b5212f">Social</a></li>
<li><a href="#orgbc2f383">Physics</a></li>
<li><a href="#orgda80b56">Software</a>
<ul>
<li><a href="#org9abdb06">Organizations</a></li>
<li><a href="#orgb84785a">Packages</a></li>
<li><a href="#orgd4250ee">Etc</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Links and information associated with the named corporeal being.
</p>

<div id="outline-container-org9b5212f" class="outline-2">
<h2 id="org9b5212f">Social</h2>
<div class="outline-text-2" id="text-org9b5212f">
<ul class="org-ul">
<li>bv at bnl dot gov (work)</li>
<li>brett dot viren at gmail dot com (personal)</li>
<li><code>@bv:matrix.org</code></li>
<li><a href="https://github.com/brettviren/">https://github.com/brettviren/</a></li>
<li><a href="https://fosstodon.org/@bv">https://fosstodon.org/@bv</a></li>
<li><a href="https://twitter.com/brett_viren">https://twitter.com/brett_viren</a></li>
<li><a href="https://keybase.io/brettviren">https://keybase.io/brettviren</a></li>
<li><a href="https://www.reddit.com/user/brettviren">https://www.reddit.com/user/brettviren</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbc2f383" class="outline-2">
<h2 id="orgbc2f383">Physics</h2>
<div class="outline-text-2" id="text-orgbc2f383">
<ul class="org-ul">
<li><a href="https://www.phy.bnl.gov/~bviren/">https://www.phy.bnl.gov/~bviren/</a> is mostly a file distribution area</li>
<li>many of the software links pertain to my physics work</li>
</ul>
</div>
</div>

<div id="outline-container-orgda80b56" class="outline-2">
<h2 id="orgda80b56">Software</h2>
<div class="outline-text-2" id="text-orgda80b56">
</div>
<div id="outline-container-org9abdb06" class="outline-3">
<h3 id="org9abdb06">Organizations</h3>
<div class="outline-text-3" id="text-org9abdb06">
<p>
A few of the software organizations (loose definition) I contribute to
</p>

<ul class="org-ul">
<li><a href="https://github.com/wirecell/">Wire-Cell project</a> (arch/dev/writer)
<ul class="org-ul">
<li>related <a href="https://github.com/brettviren/pcbro">PCB readout</a></li>
<li>and <a href="https://github.com/brettviren/drifires">field calculator</a> (see also <a href="https://github.com/brettviren/larf">larf</a>)</li>
</ul></li>
<li><a href="https://github.com/DUNE">DUNE repos</a> (GH org manager, dev/writer)</li>
<li><a href="https://github.com/DUNE-DAQ">DUNE DAQ</a> (dev/writer)
<ul class="org-ul">
<li>related <a href="https://github.com/brettviren/ptmp">ptmp</a> and <a href="https://github.com/brettviren/ptmp-tcs">ptmp-tcs</a> self trigger for ProtoDUNE-SP detector and <a href="https://github.com/brettviren/tpquery">tpquery</a> trigger primitive server.</li>
</ul></li>
<li><a href="https://github.com/ls4gan">LS4GAN</a> (initial idea, LDRD co-recipient)</li>
</ul>
</div>
</div>

<div id="outline-container-orgb84785a" class="outline-3">
<h3 id="orgb84785a">Packages</h3>
<div class="outline-text-3" id="text-orgb84785a">
<p>
I currently use <a href="https://github.com/brettviren/">GitHub/brettviren</a> for all my publicly available software, documentation and configuration.  
</p>

<ul class="org-ul">
<li><a href="https://brettviren.github.io/moo/">moo</a> is a tool for schema driven code generation used in DUNE-DAQ and others.</li>
<li><a href="https://brettviren.github.io/zio/">zio</a> provides a high-level interface to ZeroMQ, Zyre and implements some patterns described in the zguide.  Provides the <code>domo</code> and <code>flow</code> protocols.</li>
<li><a href="https://github.com/brettviren/yamz">yamz</a> is you and me, Zyre.</li>
<li><a href="https://github.com/brettviren/gegede">gegede</a> is for general geometry description (for describing detector geometry).</li>
<li><a href="https://brettviren.github.io/herbie">herbie</a> is a herbstluftwm interactive environment thingy.</li>
<li><a href="https://github.com/brettviren/rephile">rephile</a> photo manager</li>
<li><a href="https://brettviren.github.io/cppzmq-tour">cppzmq tour</a> gives a walk through of one of the C++ bindings to ZeroMQ (and a wip companion giving a cppzmq version of ZeroMQ security <a href="https://github.com/brettviren/cppzmq-houses">"houses"</a>).
<ul class="org-ul">
<li>related <a href="https://github.com/brettviren/generaldomo">generaldomo</a> generalizes ZeroMQ majordomo to CLIENT/SERVER sockets (see also <code>domo</code> in ZIO)</li>
</ul></li>
<li><a href="https://github.com/brettviren/zperfmq">zperfmq</a> tests ZeroMQ performance, applied to a 100 Gbps test network.</li>
<li><a href="https://github.com/brettviren/gravio">gravio</a> plays with graph visualization.</li>
<li>Two implementations of <a href="https://github.com/barabo/advanced-shell-history">advanced-shell-history</a>: <a href="https://github.com/brettviren/fishql">fishql</a> for Fish shell and <a href="https://github.com/brettviren/shist">shist</a> for Bash shell.</li>
<li><a href="https://github.com/brettviren/nuosc">nuosc++</a> package for calculating neutrino oscillation probabilities in vacuum, constant and arbitrary matter.</li>
<li><a href="https://github.com/brettviren?tab=repositories">all my repos</a> including many experimental dead ends and a few forked from others.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd4250ee" class="outline-3">
<h3 id="orgd4250ee">Etc</h3>
<div class="outline-text-3" id="text-orgd4250ee">
<ul class="org-ul">
<li><a href="howido.html">how I do some things</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Viren</p>
<p class="date">Created: 2021-02-09 Tue 14:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
